In [1]:
import numpy as np
import pandas as pd

In [2]:
data ={
    'Name': ['Alice', 'Bob', 'Charlie', 'David','Priya',None],
    'Marks': [85, 90,None, 78, 88, 92],
    'Age': [20, 21, 19, 22, None, 23],
    'City': ['New York', 'Los Angeles', 'Chicago', 'Houston', 'Phoenix', 'San Francisco']
}

In [3]:
df = pd.DataFrame(data)

In [7]:
df.head(6)

      Name  Marks   Age           City
0    Alice   85.0  20.0       New York
1      Bob   90.0  21.0    Los Angeles
2  Charlie    NaN  19.0        Chicago
3    David   78.0  22.0        Houston
4    Priya   88.0   NaN        Phoenix
5     None   92.0  23.0  San Francisco

In [8]:
print("Original Data:\n", df)

Original Data:
       Name  Marks   Age           City
0    Alice   85.0  20.0       New York
1      Bob   90.0  21.0    Los Angeles
2  Charlie    NaN  19.0        Chicago
3    David   78.0  22.0        Houston
4    Priya   88.0   NaN        Phoenix
5     None   92.0  23.0  San Francisco

In [9]:
df_clean = df.dropna()

In [10]:
print("\nAfter Removing Missing Values:\n", df_clean)

After Removing Missing Values:
     Name  Marks   Age         City
0  Alice   85.0  20.0     New York
1    Bob   90.0  21.0  Los Angeles
3  David   78.0  22.0      Houston

In [12]:
avg_marks = df_clean['Marks'].mean()
print("\nAverage Marks:", avg_marks)

Average Marks: 84.33333333333333

In [15]:
grouped_data = df_clean.groupby('City').agg(
    Average_Marks=('Marks', 'mean'),
    Count=('Name', 'count')
)
print("\nGrouped Data by City:\n", grouped_data)

Grouped Data by City:
              Average_Marks  Count
City
Houston               78.0      1
Los Angeles           90.0      1
New York              85.0      1